def area(a, b):
    '''
    Принимает две перпендикулярные стороны прямоугольника и возвращает его площадь

    Параметры:
        a (float): Первая сторона прямоугольника
        b (float): Вторая сторона прямоугольника

    Возвращаемое значение:
        area (float): Площадь прямоугольника 
    '''
    return a * b

def perimeter(a, b:)
    '''
    Принимает две перпендикулярные стороны прямоугольника и возвращает его периметр

    Параметры:
        a (float): Первая сторона прямоугольника
        b (float): Вторая сторона прямоугольника

    Возвращаемое значение:
        perimeter (float): Периметр прямоугольника 
    '''

    return 2*a + 2*b